// - Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу.
// let array = ['a', 'b', 'c'];
// for (let i = 3, y=1; i < 6 ; i++, y++) {
//     array[i] = y;
// }
// console.log(array);

// - Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1].
// let array = [1, 2, 3];
// for(let i=0, j=array.length-1; i<j; i++, j--){
//     let temp = array[i];
//     array[i] = array[j];
//     array[j] = temp;
// }
// console.log(array);

// - Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.
// let array = [1, 2, 3];
// for (let i = 4; i < 7; i++) {
//     array[i-1] = i;
// }

// Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.
// let array = [1, 2, 3];
// array.unshift(4, 5, 6);
// console.log(array);

// - Дан масив [1, 2, 3, 4, 5]. Перетворіть масив в [4, 5].
// let array = [1, 2, 3, 4, 5];
// array.splice(0, 3);
// console.log(array);

// - Дан масив [1, 2, 3, 4, 5]. Перетворіть масив в [1,2].
// let array = [1, 2, 3, 4, 5];
// array.splice(2, array.length);
// console.log(array);

// - Дан масив [1, 2, 3, 4, 5]. Зробіть з нього масив [1, 2, 3, 'a', 'b', 'c'].
// let array = [1, 2, 3, 4, 5];
// array.splice (3, 4, 'a', 'b', 'c');
// console.log(array);

// - Взяти масив з 10 чисел або створити його. 
// Вивести в консоль тільки ті елементи, значення яких є парними.
// let array = [1, 2, 3, 4, 5, 55, 66, 17, 99, 31, 22];
// for (let i = 0; i < array.length; i++) {
//     if (!(array[i] % 2)) {
//          console.log(array[i]);
//     }
// }

// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. 
// За допомогою будь-якого циклу скопіювати значення одного масиву в інший.
// let array = [1, 2, 3, 4, 5, 55, 66, 17, 99, 31, 22];
// let array2 = [];
// for (let i = 0; i < array.length; i++) {
//     array2[i] = array[i];
// }
// console.log(array2);

// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово.
// let array = [ 'a', 'b', 'c'];
// let result = '';
// for (let i = 0; i < array.length; i++) {
//     result = result + array[i];
// }
// console.log(result);

// - Дано масив: [ 'a', 'b', 'c'] . 
// За допомогою циклу while зібрати всі букви в слово.
// let array = [ 'a', 'b', 'c'];
// let result = '', i = 0 ;
// while (i < array.length) {
//     result = result + array[i];
//     i++
// }
// console.log(result);

// Дано масив: [ 'a', 'b', 'c'] . 
// За допомогою циклу for of зібрати всі букви в слово.
// let array = [ 'a', 'b', 'c'];
// let result = '';
// for (let i of array) {
//     result = result + i;
// }
// console.log(result);

// =====ДОДАТКОВО 1=======
// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
let array = [2,17,13,6,22,31,45,66,100,-18];
// 1. перебрати його циклом while
// i = 0;
// while (i < array.length) { console.log(array[i]); i++;}
// 2. перебрати його циклом for
// for (let i = 0; i < array.length; i++) {
//     console.log(array[i]);
// }
// 3. перебрати циклом while та вивести  числа тільки з непарним індексом
i = 0;
while (i < array.length) { 
    console.log(array[i]); i++;
}
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// 5. перебрати циклом while та вивести  числа тільки парні  значення
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// 7. замінити кожне число кратне 3 на слово "okten"
// 8. вивести масив в зворотньому порядку.
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
// 10
//  створити пустий масив та :
// - заповнити його 50 парними числами за допомоги циклу.
// - заповнити його 50 непарними числами за допомоги циклу.